---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RoutingCriterionBase Properties
RoutingCriterionBase Class See Also Send Feedback
---

The RoutingCriterionBase type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RoutingCriterionBase Class

Autodesk.Revit.DB Namespace